#include <stdio.h>
#define MAX 32

int m[MAX];  // Масив для збереження чисел

int main() {
    int p;  // Змінна для збереження введеного числа
    scanf("%d", &p);  // Зчитування числа p з консолі
    m[1] = 2;  // Перше число
    m[2] = 4;  // Друге число
    for (int i = 3; i <= p; i++) {
        m[i] = m[i - 1] + m[i - 2];  // Обчислення наступного числа як суми двох попередніх чисел
    }
    printf("%d\n", m[p]);  // Виведення значення m[p], де p - введене число
    return 0;
}
